[
    { "_id": "RS101",
      "name": "Rocket Propulsion", "number": "RS4550", 
      "startDate": "2023-01-10",
      "endDate": "2023-05-15",
      "description": "This course covers the fundamentals of rocket propulsion, including combustion processes, fluid flow, solid and liquid propellants, nozzle theory, and chemical rocket propulsion cycles. The course also covers the fundamentals of electric propulsion, including electrostatic and electromagnetic thrusters, and plasma physics. The course concludes with a discussion of advanced propulsion concepts, including nuclear propulsion, solar sails, and antimatter propulsion.",
      "image": "rocket.jpeg"
    },
    { "_id": "RS102",
      "name": "Aerodynamics", "number": "RS4560", 
      "startDate": "2023-01-10", 
      "endDate": "2023-05-15",
      "description": "This course covers the fundamentals of aerodynamics, including airfoil theory, wing theory, and compressible flow. The course also covers the fundamentals of flight mechanics, including aircraft performance, stability, and control. The course concludes with a discussion of advanced aerodynamic concepts, including hypersonic flow, high-lift systems, and computational fluid dynamics.",
      "image": "aero.png"
    },
    { "_id": "RS103",
      "name": "Spacecraft Design", "number": "RS4570", 
      "startDate": "2023-01-10", "endDate": "2023-05-15",
      "description": "This course covers the fundamentals of spacecraft design, including mission analysis, spacecraft subsystems, and spacecraft configuration. The course also covers the fundamentals of spacecraft dynamics, including orbital mechanics, attitude dynamics, and attitude control. The course concludes with a discussion of advanced spacecraft design concepts, including interplanetary trajectories, rendezvous and docking, and space debris mitigation."
    },
    { "_id": "WD101",
      "name": "Web Development", "number": "WD1607", 
      "startDate": "2023-01-10", "endDate": "2023-05-15",
      "description": "This course gives students a solid foundation in web development. Students will learn the fundamentals of HTML, CSS, and JavaScript. Students will also learn how to use the Bootstrap framework to build responsive websites. The course concludes with a discussion of advanced web development concepts, including web application development, web security, and web accessibility.",
      "image": "webdev.jpeg"
    },
    {
      "_id": "CG204",
      "name": "Blockchain Technologies", "number": "CG2944",
      "startDate": "2023-01-10", 
      "endDate": "2023-05-15",
      "description": "This course gives an overview of a decentralized, distributed and public digital ledger that is used to record transactions across many computers so that the record cannot be altered retroactively without the alteration of all subsequent blocks and the consensus of the network."
    }
]
  